# [作業目標]

1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```


2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

# 作業

### 1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```

In [ ]:
'2013-01-01':選取索引為'2013-01-01'的所有欄位
'2013-01-01':'2013-01-05' :選取索引從'2013-01-01'到'2013-01-05'的所有欄位
'A':限定選取A欄位
['A','B']:選取'A'和'B'兩個欄位
'A':'C':選取'A'到'C'的欄位
(第一個參數是限定索引值,第二個是限定欄位)

### 2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

In [3]:
# 記得先 Import 正確的套件
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0 -2.088767 -0.058379  0.142228
1 -1.075485  0.706929  0.662761
2 -1.502431 -0.212732 -0.944282
3 -0.336882  0.330099 -1.763858
4 -0.341529 -1.857580 -0.674685
5  0.822073  1.725013 -0.661045

In [21]:
# - select the first 3 rows.
df.iloc[:3]

       col1      col2      col3
0 -2.088767 -0.058379  0.142228
1 -1.075485  0.706929  0.662761
2 -1.502431 -0.212732 -0.944282

In [17]:
# - select the odd rows. (index = 1, 3, 5)
df.iloc[1:7:2]

       col1      col2      col3
1 -1.075485  0.706929  0.662761
3 -0.336882  0.330099 -1.763858
5  0.822073  1.725013 -0.661045

In [19]:
# - select the last 2 columns.
df.iloc[:,-2:]

       col2      col3
0 -0.058379  0.142228
1  0.706929  0.662761
2 -0.212732 -0.944282
3  0.330099 -1.763858
4 -1.857580 -0.674685
5  1.725013 -0.661045

In [24]:
# - select the even columns. (index = 0, 2, 4)
df.iloc[:,1:3:2]

       col2
0 -0.058379
1  0.706929
2 -0.212732
3  0.330099
4 -1.857580
5  1.725013

### 3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

In [25]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df

     0   1   2   3
0   32  38  26  18
1   10  29  35  30
2   15  18  17  28
3   18  12  20  35
4   34  30  27  12
5   12  29  22  37
6   39  15  26  11
7   15  27  32  17
8   11  30  17  36
9   30  10  19  10
10  26  35  16  18
11  28  31  27  19
12  38  24  11  19
13  37  15  36  16
14  34  26  39  38

In [26]:
# - 1. filtered by first column > 20?
df[df[0]>20]

     0   1   2   3
0   32  38  26  18
4   34  30  27  12
6   39  15  26  11
9   30  10  19  10
10  26  35  16  18
11  28  31  27  19
12  38  24  11  19
13  37  15  36  16
14  34  26  39  38

In [27]:
# - 2. filtered by first column + second column > 50
df[df[0]+df[1]>50]

     0   1   2   3
0   32  38  26  18
4   34  30  27  12
6   39  15  26  11
10  26  35  16  18
11  28  31  27  19
12  38  24  11  19
13  37  15  36  16
14  34  26  39  38

In [29]:
# - 3. filtered by first column < 30 or second column > 30
df[(df[0]<30) | (df[1]>30)]

     0   1   2   3
0   32  38  26  18
1   10  29  35  30
2   15  18  17  28
3   18  12  20  35
5   12  29  22  37
7   15  27  32  17
8   11  30  17  36
10  26  35  16  18
11  28  31  27  19

In [33]:
# - 4. filtered by total sum of row > 100
df[df.sum(axis=1)>100]

     0   1   2   3
0   32  38  26  18
1   10  29  35  30
4   34  30  27  12
11  28  31  27  19
13  37  15  36  16
14  34  26  39  38